from game import Game
# TODO: PEP8を調べて、準拠した書き方に変える
# TODO: docstringを書く(PEP8)
# TODO: 定数は全て大文字のスネークケース(PEP8)
# TODO: クラス名はパスカルケース(PEP8)
# TODO: クラスメソッドとインスタンスメソッドの違いを理解して書く
# TODO: 単一メソッドに役割を分離する
# TODO: 例えば、draw_appleなのに、当たり判定もしてるし、りんごも移動させてるし、凝縮させすぎ
# TODO: 変数の名前に気をつける。bottom_top　とか矛盾してるからね
# TODO: settingsは出来るだけ定数だけおきたい。グローバル変数みたいな使い方は管理がしづらい
# TODO: スペルミスがチラホラあるので、エディターのスペルミスチェック機能をちゃんと使おう
# TODO: 現時点で必要のない実装はしない。(YAGNIの原則)
# TODO: オブジェクト指向を学び直すといいかも。
# TODO: モジュール間の通信が多く、結合度が高い。デザインパターン等を学ぶと良いかも
# TODO: テストを書く前提でコードを考えると凝縮度が低いコードを書けると思う。テストを学ぶといいかも
# TODO: リストみたいな複数存在するものは複数形のsを丁寧に使ってあげると分かりやすいかも。esになる英単語もあります
# TODO: 今回はできてないけど、testsにテストコードを書いていく。(python unittestで検索)
# TODO: pythonの型宣言も行うように意識するといいかも。今回はやってないけど
# TODO: リファクタリングしていく上で、画面表示が綺麗になりました。やったね
# TODO: 自力でコード書けるレベルになっててすごい！あとはオブジェクト指向とかを上手く使えるとBetterなんだけど、これは難しいから少しずつ本を読んでいくといいと思う(俺も出来てない)


if __name__ == '__main__':
    # TODO: インスタンス化したので、もう一度やる？画面が簡単に実装できるはず
    Game()
